Revit 2024 API
IViewSheetSet Properties
The IViewSheetSet type exposes the following members.
Properties
Name | Description
IsAutomatic
 Automatic order or manual order.
OrderedViewList
 Ordered views.
SheetOrganizationId
ElementId to the BrowserOrganization for sheets.
ViewOrganizationId
ElementId to the BrowserOrganization for non-sheet views.
Views
The views.
See Also
IViewSheetSet Interface
Autodesk.Revit.DB Namespace